app/Controllers/Auth.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'juana01'
AND `password` = '123456'
AND `usuarios`.`deleted_at` IS NULL
 LIMIT 1
---
    public function acceder()
    {
        $session = session();
        $model = new UsuarioModel();
        $perfilModel = new PerfilModel();
        $usuario = $this->request->getPost('usuario');
        $password = $this->request->getPost('password');

        $data = $model
                ->where('usuario', $usuario)
                ->where('password',$password)
                ->first();