app/Controllers/Contenido.php

SELECT *
FROM `contenidos`
WHERE `idModulo` = '2'
AND `deleted_at` IS NULL
AND `contenidos`.`deleted_at` IS NULL
ORDER BY `tipo` ASC
---
    public function index($idModulo)
    {
        $model = new ContenidoModel();
        $data['contenido'] = $model->where('idModulo', $idModulo)
                                   ->where('deleted_at', null)
                                   ->orderBy('tipo', 'asc')
                                   ->findAll();