app/Controllers/Curso.php

    public function index()
    {
        $model = new CursoModel();
        $data['cursos'] = $model->where('deleted_at', null)->findAll();
---
SELECT *
FROM `cursos`
WHERE `deleted_at` IS NULL
AND `cursos`.`deleted_at` IS NULL

    public function edit($id)
    {
        $model = new CursoModel();
        return $this->response->setJSON($model->find($id));
---
SELECT *
FROM `cursos`
WHERE `cursos`.`deleted_at` IS NULL
AND `cursos`.`id` = '1'