app/Controllers/Dashboard.php

SELECT *
FROM `usuario_curso`
WHERE `idUsuario` = '1'
AND `idCurso` = 1
AND `usuario_curso`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `cursos`
WHERE `cursos`.`deleted_at` IS NULL
AND `cursos`.`id` = 1
SELECT *
FROM `modulos`
WHERE `idCurso` = 1
AND `deleted_at` IS NULL
AND `modulos`.`deleted_at` IS NULL
ORDER BY `orden` ASC
---
    public function curso(int $idCurso)
    {
        // 1) Usuario logueado garantizado por el filtro 'auth'
        $idUsuario = session()->get('idUsuario');

        // 2) Verificar inscripción
        $uc = new UsuarioCursoModel();
        $inscrito = $uc->where('idUsuario', $idUsuario)
            ->where('idCurso', $idCurso)
            ->first();

        if (!$inscrito) {
            return redirect()->to('/curso/' . $idCurso)
                ->with('error', 'Debes estar inscrito para ver el contenido de este curso.');
        }

        // 3) Cargar datos del curso, módulos y contenidos
        $cursoModel = new CursoModel();
        $moduloModel = new ModuloModel();
        $contenidoModel = new ContenidoModel();

        $curso = $cursoModel->find($idCurso);
        if (!$curso) {
            return redirect()->to('/dashboard')->with('error', 'Curso no encontrado.');
        }

        $modulos = $moduloModel->where('idCurso', $idCurso)
            ->where('deleted_at', null)
            ->orderBy('orden', 'ASC')
            ->findAll();

SELECT *
FROM `cursos`
WHERE `deleted_at` IS NULL
AND `cursos`.`deleted_at` IS NULL
SELECT *
FROM `usuario_curso`
WHERE `idUsuario` = '1'
AND `deleted_at` IS NULL
AND `usuario_curso`.`deleted_at` IS NULL
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        $idUsuario = session()->get('idUsuario');
        //$idUsuario = session('id');
        $cursoModel = new CursoModel();
        $usuarioCursoModel = new UsuarioCursoModel();

        $cursos = $cursoModel->where('deleted_at', null)->findAll();
        $inscritos = $usuarioCursoModel
            ->where('idUsuario', $idUsuario)
            ->where('deleted_at', null)
            ->findAll();