app/Controllers/Modulo.php

    public function index($idCurso)
    {
        $model = new ModuloModel();
        $data['modulos'] = $model->where('idCurso', $idCurso)
                                 ->where('deleted_at', null)
                                 ->orderBy('orden', 'asc')
                                 ->findAll();
---
SELECT *
FROM `modulos`
WHERE `idCurso` = '1'
AND `deleted_at` IS NULL
AND `modulos`.`deleted_at` IS NULL
ORDER BY `orden` ASC