app/Controllers/Page.php

    public function index()
    {
        $cursoModel = new CursoModel();
        $cursos = $cursoModel->findAll();
---
SELECT *
FROM `cursos`
WHERE `cursos`.`deleted_at` IS NULL

    public function curso($id)
{
    $cursoModel = new CursoModel();
    $moduloModel = new ModuloModel();
    $inscripcionModel = new \App\Models\UsuarioCursoModel();

    $curso = $cursoModel->find($id);
    if (!$curso) {
        throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Curso no encontrado");
    }

    $modulos = $moduloModel->where('idCurso', $id)->orderBy('orden', 'asc')->findAll();

    $usuarioInscrito = false;

    if (session()->has('idUsuario')) {
        $idUsuario = session()->get('idUsuario');
        $usuarioInscrito = $inscripcionModel
            ->where('idUsuario', $idUsuario)
            ->where('idCurso', $id)
            ->first() !== null;
---
SELECT *
FROM `cursos`
WHERE `cursos`.`deleted_at` IS NULL
AND `cursos`.`id` = '1'
SELECT *
FROM `modulos`
WHERE `idCurso` = '1'
AND `modulos`.`deleted_at` IS NULL
ORDER BY `orden` ASC
SELECT *
FROM `usuario_curso`
WHERE `idUsuario` = '1'
AND `idCurso` = '1'
AND `usuario_curso`.`deleted_at` IS NULL
 LIMIT 1